In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
s=pd.Series([3,2,9,10])

In [6]:
print(s)

0     3
1     2
2     9
3    10
dtype: int64

In [7]:
type(s)

pandas.core.series.Series

In [9]:
s[0]

3

In [9]:
s[3]

10

In [4]:
s=pd.Series([22,56,88.8,96])

In [5]:
print(s)

0    22.0
1    56.0
2    88.8
3    96.0
dtype: float64

In [10]:
s=pd.Series([22,56,88,96],index=['age','weight','pulse','oxygenrate'])

In [13]:
print(s)

age           22
weight        56
pulse         88
oxygenrate    96
dtype: int64

In [14]:
s['age']

22

In [21]:
s=pd.Series({'a':22,'b':56,'c':88,'d':96})

In [22]:
print(s)

a    22
b    56
c    88
d    96
dtype: int64

In [24]:
s['a']

22

In [32]:
s1=pd.Series(data=[3,2,9,6],index=['a','b','c','d'])

In [33]:
s2=pd.Series(data=[4,2,8,6],index=['b','d','x','y'])

In [34]:
s1+s2

a    NaN
b    6.0
c    NaN
d    8.0
x    NaN
y    NaN
dtype: float64

# nan=not a number

In [35]:
s1=pd.Series(data=[3,2,9,6])

In [36]:
s2=pd.Series(data=[4,2,8,6])

In [37]:
s1+s2

0     7
1     4
2    17
3    12
dtype: int64

In [3]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [4]:
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# series is one dimension,dataframe is two dimension

In [6]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['a','b','c'])

In [7]:
print(df)

   0  1  2
a  1  2  3
b  4  5  6
c  7  8  9

In [12]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['a','b','c'],columns=['x','y','z'])

In [13]:
df

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

In [14]:
df['x']

a    1
b    4
c    7
Name: x, dtype: int64

In [16]:
df.loc['a']

x    1
y    2
z    3
Name: a, dtype: int64

## loc=location

In [10]:
df.iloc[0]

x    1
y    2
z    3
Name: a, dtype: int64

In [15]:
df[0]

KeyError: 0

In [11]:
df1=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [12]:
print(df1)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
df1[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [21]:
df1.iloc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [61]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['a','b','c'],columns=['x','y','z'])

In [62]:
df.describe()

         x    y    z
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [63]:
df

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

In [64]:
df['x']

a    1
b    4
c    7
Name: x, dtype: int64

In [65]:
df[['x','y']]

   x  y
a  1  2
b  4  5
c  7  8

In [66]:
df['x']+df['y']

a     3
b     9
c    15
dtype: int64

In [67]:
df['new']=df['x']+df['y']

In [68]:
print(df['new'])

a     3
b     9
c    15
Name: new, dtype: int64

In [8]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['a','b','c'],columns=['x','y','z'])

In [9]:
df.loc[['a','b']]

   x  y  z
a  1  2  3
b  4  5  6

In [10]:
df['n']=[12,5,7]

In [12]:
df.loc['e']=[1,2,3,4]

In [13]:
print(df)

   x  y  z   n
a  1  2  3  12
b  4  5  6   5
c  7  8  9   7
e  1  2  3   4

In [72]:
df.drop('n',axis=1)

   x  y  z  new
a  1  2  3    3
b  4  5  6    9
c  7  8  9   15

In [73]:
df

   x  y  z  new   n
a  1  2  3    3  12
b  4  5  6    9   5
c  7  8  9   15   7

## in pandas column is 1 row is 0

In [74]:
df.drop('n',axis=1,inplace=True)

In [75]:
df

   x  y  z  new
a  1  2  3    3
b  4  5  6    9
c  7  8  9   15

In [76]:
df.loc['d']=[4,5,6,7]

In [77]:
df

   x  y  z  new
a  1  2  3    3
b  4  5  6    9
c  7  8  9   15
d  4  5  6    7

In [78]:
df.drop('d',axis=0,inplace=True)

In [79]:
df

   x  y  z  new
a  1  2  3    3
b  4  5  6    9
c  7  8  9   15

In [80]:
df.drop('b',axis=0)

   x  y  z  new
a  1  2  3    3
c  7  8  9   15

In [81]:
df

   x  y  z  new
a  1  2  3    3
b  4  5  6    9
c  7  8  9   15

In [83]:
df.loc[['a','c']]

   x  y  z  new
a  1  2  3    3
c  7  8  9   15

In [84]:
df>3

       x      y      z    new
a  False  False  False  False
b   True   True   True   True
c   True   True   True   True

In [85]:
df[df>3]

     x    y    z   new
a  NaN  NaN  NaN   NaN
b  4.0  5.0  6.0   9.0
c  7.0  8.0  9.0  15.0

In [86]:
df[df['y']>3]

   x  y  z  new
b  4  5  6    9
c  7  8  9   15

In [88]:
df[df['y']>3][['x','z']]

   x  z
b  4  6
c  7  9

In [6]:
df=pd.DataFrame([[11,75,39],[56,62,90],[23,89,13]],index=['a','b','c'],columns=['x','y','z'])

In [7]:
df.describe()

              x          y          z
count   3.00000   3.000000   3.000000
mean   30.00000  75.333333  47.333333
std    23.30236  13.503086  39.170567
min    11.00000  62.000000  13.000000
25%    17.00000  68.500000  26.000000
50%    23.00000  75.000000  39.000000
75%    39.50000  82.000000  64.500000
max    56.00000  89.000000  90.000000

In [8]:
df=pd.DataFrame([[23,15,99],[66,7,88],[11,2,156]],index=['a','b','c'],columns=['x','y','z'])

In [9]:
df.describe()

               x          y           z
count   3.000000   3.000000    3.000000
mean   33.333333   8.000000  114.333333
std    28.919428   6.557439   36.501142
min    11.000000   2.000000   88.000000
25%    17.000000   4.500000   93.500000
50%    23.000000   7.000000   99.000000
75%    44.500000  11.000000  127.500000
max    66.000000  15.000000  156.000000

In [4]:
na=np.random.rand(5,4)

In [5]:
na

array([[0.42002182, 0.39594524, 0.34100514, 0.62750519],
       [0.27852583, 0.57883759, 0.98362377, 0.50260103],
       [0.51951279, 0.26660917, 0.39434125, 0.81750659],
       [0.48246232, 0.66897139, 0.70907745, 0.29654765],
       [0.75425355, 0.74693891, 0.66861678, 0.26137918]])

In [6]:
df=pd.DataFrame(na)

In [7]:
df

          0         1         2         3
0  0.420022  0.395945  0.341005  0.627505
1  0.278526  0.578838  0.983624  0.502601
2  0.519513  0.266609  0.394341  0.817507
3  0.482462  0.668971  0.709077  0.296548
4  0.754254  0.746939  0.668617  0.261379

In [21]:
from numpy.random import randn

In [22]:
df=pd.DataFrame(randn(5,4))

In [20]:
df

          0         1         2         3
0  1.311419  1.103255  0.104373 -0.765983
1 -0.912568 -1.156574 -0.015348  1.112703
2  0.937777 -0.205804  0.123929 -0.126828
3 -2.140708  1.104618  0.616767 -0.226391
4  0.959612  0.014518 -0.844604 -0.303784

In [21]:
df.describe()

              0         1         2         3
count  5.000000  5.000000  5.000000  5.000000
mean   0.031106  0.172003 -0.002977 -0.062057
std    1.494212  0.957818  0.529198  0.700929
min   -2.140708 -1.156574 -0.844604 -0.765983
25%   -0.912568 -0.205804 -0.015348 -0.303784
50%    0.937777  0.014518  0.104373 -0.226391
75%    0.959612  1.103255  0.123929 -0.126828
max    1.311419  1.104618  0.616767  1.112703